# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [9]:
#Your code here
import sqlite3 
import pandas as pd
conn = sqlite3.Connection('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [33]:
#Your code here
cur.execute("""select firstName, lastName from employees e join offices o on e.officeCode = o.officeCode where city = 'Boston';""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [42]:
#Your code here
cur.execute("""select city, count(*) 
from offices
join employees 
using(officeCode) 
group by city""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

            city  count(*)
0         Boston         2
1         London         2
2            NYC         2
3          Paris         5
4  San Francisco         6
5         Sydney         4
6          Tokyo         2

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [ ]:
# Your code here

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold

In [48]:
# Your code here
cur.execute("""select firstName, lastName, productName
from employees e
join
customers c
on e.employeeNumber = c.salesRepEmployeeNumber
join orders o
using(customerNumber)
join orderdetails od
using(orderNumber)
join products p
using(productCode)""")
dfa = pd.DataFrame(cur.fetchall())
dfa.columns = [i[0] for i in cur.description]
dfa.head(25)

   firstName  lastName                                  productName
0     Leslie  Jennings                               1958 Setra Bus
1     Leslie  Jennings                       1940 Ford Pickup Truck
2     Leslie  Jennings                      1939 Cadillac Limousine
3     Leslie  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4     Leslie  Jennings                            1968 Ford Mustang
5     Leslie  Jennings                           1968 Dodge Charger
6     Leslie  Jennings                      1970 Plymouth Hemi Cuda
7     Leslie  Jennings                           1969 Dodge Charger
8     Leslie  Jennings                  1948 Porsche 356-A Roadster
9     Leslie  Jennings                         1969 Dodge Super Bee
10    Leslie  Jennings                        1976 Ford Gran Torino
11    Leslie  Jennings                             1957 Vespa GS150
12    Leslie  Jennings                    1957 Corvette Convertible
13    Leslie  Jennings                      1982 Ducati 900 Monster
14    Leslie  Jennings                      1982 Lamborghini Diablo
15    Leslie  Jennings                    1971 Alpine Renault 1600s
16    Leslie  Jennings                      1956 Porsche 356A Coupe
17    Leslie  Jennings                        1961 Chevrolet Impala
18    Leslie  Jennings                            1982 Ducati 996 R
19    Leslie  Jennings                    1974 Ducati 350 Mk3 Desmo
20    Leslie  Jennings                           2002 Yamaha YZR M1
21    Leslie  Jennings                            2001 Ferrari Enzo
22    Leslie  Jennings                           1969 Corvair Monza
23    Leslie  Jennings                             1969 Ford Falcon
24    Leslie  Jennings                            1903 Ford Model A

## Level Up: Display the Number of Products each employee has sold

In [49]:
#Your code here
dfa.groupby([0,1]).count()

KeyError: 0

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!